var app = new Vue({
  el: '#app',
  data: {
    page: "visitors",
    waiting: true,

    //---------------------------------------------

    "doctor": { "stats": { "Интеллект": 5, "Эмпатия": 10, "Харизма": 13, "Трудолюбие": 11, "Интуиция": 8, "Аккуратность": 13 }, "skills": { "Сбор трав": 8.5, "Общая диагностика": 8.5, "Фармакология": 8.5, "Теоретическая алхимия": 8.5, "Прикладная  алхимия": 8.5, "Книговедение": 8.5, "Углубленная диагностика": 8.5, "Терапия": 8.5, "Торговля": 8.5, "Самореклама": 8.5, "Самодиагностика": 8.5, "Гигиена": 8.5 }, "ap": 10, "max_ap": 10, "day": 2, "fame": 1, "money": 100, "known_flora": ["Паслён чёрный", "Донник лекарственный", "Бессмертник песчаный", "Бедренец анисовый", "Буквица лекарственная", "Мята перечная", "Вероника лекарственная", "Кровохлёбка лекарственная", "Татарник колючий", "Полынь горькая"], "known_recipes": [], "bag": [["Паслён чёрный", 2], ["Донник лекарственный", 3], ["Бессмертник песчаный", 2], ["Бедренец анисовый", 3], ["Буквица лекарственная", 5], ["Мята перечная", 5], ["Вероника лекарственная", 2], ["Кровохлёбка лекарственная", 2], ["Татарник колючий", 5], ["Полынь горькая", 3]], "actions": [{ "skill": "Сбор трав", "name": "Собирать травы", "ap": 4 }, { "skill": "Теоретическая алхимия", "name": "Искать вещества", "ap": 5 }, { "skill": "Теоретическая алхимия", "name": "Искать вещества", "ap": 5 }, { "skill": "Теоретическая алхимия", "name": "Искать вещества", "ap": 5 }] },
    "askers": [{ name: "Нищий Лариса", status: "Нищий", maxhealth: "Нормальная", health: "Легкое недомогание", starting_health: "Здоров", diseases: ["Слоновая болезнь"], sympthoms: ["Ноющая боль в животе", "Одышка", "Боль при дыхании"] }, { name: "Нищий Люба", status: "Нищий", maxhealth: "Хилая", health: "Болен", starting_health: "Здоров", diseases: ["Скоротечная зараза"], sympthoms: ["Бессонница", "Боль в висках", "Амнезия"] }, { name: "Алкоголик Григорий", status: "Алкоголик", maxhealth: "Нормальная", health: "Болен", starting_health: "Здоров", diseases: ["Черная инфлюэнца"], sympthoms: ["Аритмия", "Обмороки", "Слабость", "Хрипы", "Амнезия"] }],
    "patients": [{ name: "Нищий Лариса", status: "Нищий", maxhealth: "Нормальная", health: "Легкое недомогание", starting_health: "Здоров", diseases: ["Слоновая болезнь"], sympthoms: ["Ноющая боль в животе", "Одышка", "Боль при дыхании"] }, { name: "Нищий Люба", status: "Нищий", maxhealth: "Хилая", health: "Болен", starting_health: "Здоров", diseases: ["Скоротечная зараза"], sympthoms: ["Бессонница", "Боль в висках", "Амнезия"] }, { name: "Алкоголик Григорий", status: "Алкоголик", maxhealth: "Нормальная", health: "Болен", starting_health: "Здоров", diseases: ["Черная инфлюэнца"], sympthoms: ["Аритмия", "Обмороки", "Слабость", "Хрипы", "Амнезия"] }]
  },

  methods: {
    next_day: function () {
      app.waiting = true;
      ws.send('d');
    },
    reset: function () {
      app.waiting = true;
      ws.send('r');
    },
    make_patient: function (i) {
      app.waiting = true;
      ws.send("m " + (0 + i));
    },
  },

  computed: {
  },
});

const ws = new WebSocket('ws://localhost:3000/ws');

ws.onopen = event => {
  // alert('onopen');
  // ws.send("Hello Web Socket!");
};

ws.onerror = event => {
  // alert(event.data);
};

ws.onmessage = event => {
  all = JSON.parse(event.data);
  app.doctor = all.doctor;
  app.askers = all.askers;
  app.patients = all.patients;
  app.waiting = false;
};

